#!/usr/bin/env node

/**
 * for generate html dom
 */
var fs = require('fs');
var targetFile = 'tmp.swp';
var data = [
  ['Date', '2015/01/28', 'Day 1'],
  ['12:30', '13:30', '報到＆集合', '於花蓮火車站集合'],
  ['13:30', '14:30', '接駁前往東華'],
  ['14:30', '15:00', '開幕'],
  ['15:00', '16:00', '小隊破冰'],
  ['16:00', '18:00', '開源精神', '開源的事物早已充斥整個世界，好比說手機作業系統「Android」，甚至整個全球的網際網路都是由開源的軟體構成（Linux、Apache…等），在台灣更有「g0v」在進行無數的社會運動，開源軟體、文化正在劇烈的影響世界，而開源最根本的精神就是「分享」，希望自己的創作能夠對人類有貢獻，而我們希望這樣的精神能被傳頌下去。'],
  ['18:00', '19:00', '晚餐'],
  ['19:00', '21:00', '夜間教育'],
  ['21:30', '22:00', '宵夜'],
  ['Date', '2015/01/29', 'Day 2'],
  ['08:00', '09:00', '早餐'],
  ['09:00', '12:30', '認識電腦硬體與網路', '電腦與智慧型手機幾乎成為了現在家家戶戶的必需品，但天天使用它們的你是否曾經了解過電腦拆開後長什麼樣子呢？又是否了解網路的真面目到底是什麼呢？讓我們一起來揭開這神秘的面紗吧！'],
  ['12:30', '13:30', '午餐'],
  ['13:30', '17:00', '程式設計！敲出你人生中的第一個程式吧！', '科技不斷進步，你用的所有手機 App、電腦軟體甚至連作業系統都是由「程式語言」寫出來的，你是否腦中曾靈光乍現一些新奇好玩的軟體呢？你是否對程式開始感到好奇了呢？讓我們一起探究程式語言的世界吧！'],
  ['17:00', '18:00', '晚餐'],
  ['18:00', '21:00', 'Arduino！開源硬體動手做！', 'Arduino 是一個開源的單晶片微控制器，它讓許多不懂程式語言的族群，也能做出酷炫的東西，例如：閃爍燈光、控制馬達等，不用很高的成本就能創造出讓人為之一亮的作品，而且價格也相當的親民。'],
  ['21:00', '22:00', '宵夜'],
  ['Date', '2015/01/39', 'Day 3'],
  ['08:00', '09:00', '早餐'],
  ['09:00', '12:00', '大地遊戲'],
  ['12:00', '13:00', '午餐'],
  ['13:00', '17:00', '資訊安全？你知道駭客都藏在你不知道的地方嗎？', '活在一個網路的時代，人們在網路上使用社群網站、搜尋資料、傳遞訊息早已稀鬆平常，因此「資訊安全」更顯得無比重要，試想有人試圖利用社群網站來獲取你的個人訊息及生活、監控你正在搜尋什麼關鍵字、攔截你傳送的訊息，這樣的網路不是很可怕嗎？所以資訊安全已經成為人人必須重視的問題了。'],
  ['17:00', '18:00', '晚餐'],
  ['18:00', '21:00', '密室逃脫'],
  ['21:00', '22:00', '宵夜'],
  ['Date', '2015/01/31', 'Day 4'],
  ['08:00', '09:00', '早餐'],
  ['09:00', '13:30', '創造！屬於創造者的馬拉松！', '資訊界的馬拉松——「黑客松」，是指在一段時間內，一群程式設計師以緊密合作的方式，去做他們想做的事情，在短時間內激發出創造力以及將學習的成果全部展現出來，和小隊的成員一起達到目標，創造出想要的作品！'],
  ['13:30', '15:00', '閉幕＆成果發表'],
  ['15:00', '16:00', '搭車前往車站']
];
var result = "";
for (var i in data) {
  if (data[i][0] === 'Date') {
    var date = data[i][1];
    var day = data[i][2];
    if (result !== "")
      result += "</div>\n";
    var template = `<div class="col-md-6 agenda-container">
    <h3 class="agenda-date">${day} - ${date}</h3>`;
    result += template + "\n";
    continue;
  }
  var start = data[i][0];
  var end = data[i][1];
  var title = data[i][2];
  var content = data[i][3] || '';
  if (content != '')
    content = `<div class="agenda-content">
            ${content}
        </div>`;
  var template = `    <div class="agenda-item">
        <div class="agenda-left">
            ${title}
        </div>
        <div class="agenda-right">
            <p>${start} - ${end}</p>
        </div>
        ${content}
    </div>`;
  result += template + "\n";
}
result += "</div>";

fs.writeFile(targetFile, result, function(err) {
  if (err)
    console.log(err);
});
